Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
     }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:307946671795:userpool/ap-southeast-3_1pggQ2ofX",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:307946671795:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::307946671795:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*",
              + "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dataportal-locks-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-mutex-locks",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Anscestors",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Descendants",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-Ontologies",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
              + "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::307946671795:role/sbeacon_backend_ec2_deidentification_instance_role",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:307946671795:function:sbeacon-backend-performQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:performQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "BeaconApi" {
        id                           = "ie44xht6ej"
        name                         = "sbeacon-backend-api"
      ~ tags                         = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                     = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be updated in-place
  ~ resource "aws_athena_workgroup" "sbeacon-workgroup" {
        id            = "query_workgroup"
        name          = "query_workgroup"
      ~ tags          = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all      = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:307946671795:stack/sbeacon-terms-index-stack/5a966b90-b206-11ef-afd3-06f4ba1dc8c3"
        name               = "sbeacon-terms-index-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:307946671795:stack/sbeacon-terms-stack/596c4370-b206-11ef-b6b3-0ef89e602338"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "anscestor_terms" {
        id                          = "sbeacon-Anscestors"
        name                        = "sbeacon-Anscestors"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be updated in-place
  ~ resource "aws_dynamodb_table" "clinic_jobs" {
        id                          = "sbeacon-dataportal-clinic-jobs"
        name                        = "sbeacon-dataportal-clinic-jobs"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_annotations" {
        id                          = "sbeacon-dataportal-clinical-annotations"
        name                        = "sbeacon-dataportal-clinical-annotations"
      ~ tags                        = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_variants" {
        id                          = "sbeacon-dataportal-clinical-variants"
        name                        = "sbeacon-dataportal-clinical-variants"
      ~ tags                        = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_locks_table" {
        id                          = "sbeacon-dataportal-mutex-locks"
        name                        = "sbeacon-dataportal-mutex-locks"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "descendant_terms" {
        id                          = "sbeacon-Descendants"
        name                        = "sbeacon-Descendants"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be updated in-place
  ~ resource "aws_dynamodb_table" "juptyer_notebooks" {
        id                          = "sbeacon-dataportal-juptyer-notebooks"
        name                        = "sbeacon-dataportal-juptyer-notebooks"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be updated in-place
  ~ resource "aws_dynamodb_table" "ontologies" {
        id                          = "sbeacon-Ontologies"
        name                        = "sbeacon-Ontologies"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be updated in-place
  ~ resource "aws_dynamodb_table" "projects" {
        id                          = "sbeacon-dataportal-projects"
        name                        = "sbeacon-dataportal-projects"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be updated in-place
  ~ resource "aws_dynamodb_table" "saved_queries" {
        id                          = "sbeacon-dataportal-saved-queries"
        name                        = "sbeacon-dataportal-saved-queries"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be updated in-place
  ~ resource "aws_dynamodb_table" "vcfs" {
        id                          = "sbeacon-vcfs"
        name                        = "sbeacon-vcfs"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be updated in-place
  ~ resource "aws_glue_catalog_database" "metadata-database" {
        id           = "307946671795:sbeacon_metadata"
        name         = "sbeacon_metadata"
      ~ tags         = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all     = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be updated in-place
  ~ resource "aws_glue_crawler" "sbeacon-crawler" {
        id                     = "sbeacon-crawler"
        name                   = "sbeacon-crawler"
      ~ tags                   = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all               = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
        id          = "sbeacon_backend_ec2_deidentification_instance_profile"
        name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      ~ tags        = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::307946671795:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
                          - "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be updated in-place
  ~ resource "aws_iam_role" "ec2_deidentification_instance_role" {
        id                    = "sbeacon_backend_ec2_deidentification_instance_role"
        name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_iam_role.glue_role will be updated in-place
  ~ resource "aws_iam_role" "glue_role" {
        id                    = "glue_role"
        name                  = "glue_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be updated in-place
  ~ resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
        id                    = "sbeacon_backend_sagemaker_jupyter_instance_role"
        name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250110044710445000000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:43" -> (known after apply)
      ~ code_sha256                 = "AKwLoIe4awMOpUE5XAhhzGmSOvXH2t521VOakyKkfjc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-19T04:03:11.800+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:43" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "fsI2eYuGaD/qIT8qlyOvIjB+Vi4ll0O/4lsqBMKqijM/J0YiIzPud7zmLbkwX0XvcvR1Qa38q6CwrIW2ODyW7g==" -> "PEgDtFi+t4Ttmb+cSgoEHGjyW5F3xQ9HaS5A48Xng+DBosb4q5Rq1fErgKUYufJ/NgV9/Cb2law+2rLotzm7Vg==" # forces replacement
      ~ source_code_size            = 18216613 -> (known after apply)
      ~ version                     = "43" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "dataportal-bucket" {
        id                          = "gaspi-dataportal-20250110044710445000000002"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "gaspi-lambda-layers-20250110044710445300000003"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "metadata-bucket" {
        id                          = "gaspi-metadata-20250110044708770100000001"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "variants-bucket" {
        id                          = "gaspi-variants-20250110044711919900000004"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "sbeacon-backend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ tags      = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all  = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.performQuery will be updated in-place
  ~ resource "aws_sns_topic" "performQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:307946671795:performQuery"
        name                                     = "performQuery"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (29 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be updated in-place
  ~ resource "aws_sns_topic" "splitQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:307946671795:splitQuery"
        name                                     = "splitQuery"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (29 unchanged attributes hidden)
    }

  # module.security.aws_cloudwatch_event_rule.gaspi-inspector-findings[0] will be created
  + resource "aws_cloudwatch_event_rule" "gaspi-inspector-findings" {
      + arn            = (known after apply)
      + description    = "Triggers on new Amazon Inspector Findings"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Inspector2 Finding",
                ]
              + source      = [
                  + "aws.inspector2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "gaspi-inspector-findings"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "Environment" = "dev"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.security.aws_cloudwatch_event_target.gaspi-inspector-findings[0] will be created
  + resource "aws_cloudwatch_event_target" "gaspi-inspector-findings" {
      + arn            = "arn:aws:lambda:ap-southeast-3:307946671795:function:security-sendSecurityAlert"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "gaspi-inspector-findings"
      + target_id      = (known after apply)
    }

  # module.security.aws_inspector2_enabler.gaspi-inspector-enabler[0] will be created
  + resource "aws_inspector2_enabler" "gaspi-inspector-enabler" {
      + account_ids    = [
          + "307946671795",
        ]
      + id             = (known after apply)
      + resource_types = [
          + "ECR",
          + "LAMBDA",
        ]
    }

  # module.security.aws_lambda_permission.inspectorFindingLambdaTrigger[0] will be created
  + resource "aws_lambda_permission" "inspectorFindingLambdaTrigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "arn:aws:lambda:ap-southeast-3:307946671795:function:security-sendSecurityAlert"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SecurityAllowInspectorFindingLambdaTriggerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be updated in-place
  ~ resource "aws_wafv2_web_acl" "security-all-cloudfront" {
        id                          = "5bfb2e9b-9433-4a25-82ca-78803652307d"
        name                        = "security-all-cloudfront"
      ~ tags                        = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

      - rule {
          - name     = "security-all-cloudfront-common-ruleset" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "security-all-cloudfront-common-ruleset-rule-metric" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "security-all-cloudfront-common-ruleset"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-common-ruleset-rule-metric"
              + sampled_requests_enabled   = true
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket.bui-hosted-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bui-hosted-bucket" {
        id                          = "webgui-bucket-20241204060930481800000001"
      ~ tags                        = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "portal-frontend"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-customMessageLambdaTrigger"
        name              = "/aws/lambda/cognito-customMessageLambdaTrigger"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-customMessageLambdaTrigger"
        name                  = "cognito-customMessageLambdaTrigger"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "cognito-infrastructure"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "727968111526480190" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739422358809993000" -> "1747637405984219000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-logEmailDelivery"
        name              = "/aws/lambda/cognito-logEmailDelivery"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-logEmailDelivery"
        name                  = "cognito-logEmailDelivery"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "cognito-infrastructure"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "828087482748647897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739776912885900000" -> "1747637405983643000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendRegistrationEmail"
        name              = "/aws/lambda/cognito-sendRegistrationEmail"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendRegistrationEmail"
        name                  = "cognito-sendRegistrationEmail"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "cognito-infrastructure"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7858916055612022521" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627138399276000" -> "1747637406108149000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendSvepJobEmail"
        name              = "/aws/lambda/cognito-sendSvepJobEmail"
      ~ tags              = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendSvepJobEmail"
        name                  = "cognito-sendSvepJobEmail"
      ~ tags                  = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendSvepJobEmail"
      ~ tags                           = {
          ~ "Environment"           = "STAGING" -> "dev"
            "NAME"                  = "cognito-infrastructure"
          ~ "Owner"                 = "GXC" -> "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "STAGING" -> "dev"
          ~ "Owner"                 = "GXC" -> "gaspi"
            # (2 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6981771350545949209" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271410489388000" -> "1747637406124079000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "sbeacon-submitdataset-lambda-containers"
        name                 = "sbeacon-submitdataset-lambda-containers"
      ~ tags                 = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all             = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:f22db1a6bb152c023487d35f0b3a6466778a6a58eada363bdbf873e536d3faae307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:f22db1a6bb152c023487d35f0b3a6466778a6a58eada363bdbf873e536d3faae" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:e4077de0ef9f8c5a4761b31678adea3a0c203c42e41d4c0737eebd4fbbcc768d" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "52bee762c18feecd95f6994ec4efd6542139a8be" -> "44f3405871fb3103eb5c66d6445b03772846ebd1"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
         
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.